In [1]:
import pandas as pd
import numpy as np

In [3]:
check_disease = pd.read_csv("../data/heart-disease.csv")
check_disease.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

In [4]:
len(check_disease)

303

In [9]:
check_disease.isna().sum()

age         0
sex         0
cp          0
trestbps    0
chol        0
fbs         0
restecg     0
thalach     0
exang       0
oldpeak     0
slope       0
ca          0
thal        0
target      0
dtype: int64

In [10]:
# our data = do not contain any empty cell , also no string is present
# this data is gud to go for training

In [16]:
# split the data into x and y 
# where x is the input and y is the output
x=check_disease.drop("target",axis=1)
y = check_disease["target"]

0    1
1    1
2    1
3    1
4    1
Name: target, dtype: int64

In [17]:
from sklearn.model_selection import train_test_split

x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=.2)

In [21]:
x_train.shape, x_test.shape

((242, 13), (61, 13))

In [24]:
# choosing the ensemble model , and in thar choosing the random forest for classification
from sklearn.ensemble  import RandomForestClassifier

# function call
machine = RandomForestClassifier()

# training the machine 
machine.fit(x_train , y_train);

In [25]:
# checking the score(machine optimization) on the test
machine.score(x_test,y_test)

0.8524590163934426

In [29]:
# it's time to choose the integer data
car_sales_price = pd.read_csv("../data/car-sales-extended-missing-data.csv")
car_sales_price.head()

     Make Colour  Odometer (KM)  Doors    Price
0   Honda  White        35431.0    4.0  15323.0
1     BMW   Blue       192714.0    5.0  19943.0
2   Honda  White        84714.0    4.0  28343.0
3  Toyota  White       154365.0    4.0  13434.0
4  Nissan   Blue       181577.0    3.0  14043.0

In [30]:
car_sales_price.isna().sum()

Make             49
Colour           50
Odometer (KM)    50
Doors            50
Price            50
dtype: int64

In [31]:
# so in this data , we have nulls and sm data in string 
car_sales_price.dropna()

       Make Colour  Odometer (KM)  Doors    Price
0     Honda  White        35431.0    4.0  15323.0
1       BMW   Blue       192714.0    5.0  19943.0
2     Honda  White        84714.0    4.0  28343.0
3    Toyota  White       154365.0    4.0  13434.0
4    Nissan   Blue       181577.0    3.0  14043.0
..      ...    ...            ...    ...      ...
994     BMW   Blue       163322.0    3.0  31666.0
995  Toyota  Black        35820.0    4.0  32042.0
997  Nissan   Blue        66604.0    4.0  31570.0
998   Honda  White       215883.0    4.0   4001.0
999  Toyota   Blue       248360.0    4.0  12732.0

[773 rows x 5 columns]

In [32]:
len(car_sales_price)

1000

In [33]:
# it's time to turn the string into the integer 
# after that , same process
# split into x and y
# split into train and test both x and y
# choose the model
# train ie fit()
# score()

In [ ]:
# with the